{
    "portfolio": [
      {
        "id": 1,
        "title": "A Coupon Collecting Application",
        "description": "I am explain here some key of my project like... I have added top brands list with logo. if anyone click on the logo, then he can see all details that specific product. And added some social link here. So that user visit every thing by social site. And added profile page, so tht user cant update his profile, and added a use new button, by this button user can go our shop to see all the product, and also keep a button for doing copy code. so that, can see specific related product after paste that code on any search bar etc",
        "technologies": ["React", "Firebase", "Mongodb"],
        "githubLink": "https://github.com/programming-hero-web-course1/b10-a9-authentication-shahidulshohid",
        "liveLink":"https://b10-assignment-9.firebaseapp.com/",
        "projectImage": "https://i.ibb.co.com/kgYVgtL/portfolio1.png"
      },
      {
        "id": 2,
        "title": "A Game Review Application",
        "description": "I am explain here some key of my project like... I have added dark and light mode on the top. And added authentication system to use firebase. and added add reviews form so that user can add product by this form. and added a details button. User can see details about a specific product and also can add the specific product by add to watch list button. and created a my watch List page so that, user can see his adding product there. and also added a two button there, user will be able to delete and update their adding product. etc.",
        "technologies": ["React", "Firebase", "Mongodb"],
        "githubLink": "https://github.com/programming-hero-web-course2/b10-a10-client-side-shahidulshohid",
        "liveLink": "https://b10-assignment-10.firebaseapp.com/",
        "projectImage": "https://i.ibb.co.com/C5hg952/portfolio2.png"
      },
      {
        "id": 3,
        "title": "Volunteer management website",
        "description": "I am explain here some key of my project like... I have added dark and light mode on the top. And added authentication system to use firebase. and added all volunteer need post route so that everyone can see all volunteers. and added a details button. User can see details about a specific volunteer and also. and created my profile route and also create two routes add volunteer need post form and manage my post so that, can added volunteer through this form. and added one more form so that, can send request for being a become volunteer. and also added two my volunteer need section and my volunteer request section, so that they can see all the added post and request etc.",
        "technologies": ["React", "Firebase", "Mongodb"],
        "githubLink": "https://github.com/programming-hero-web-course2/b10a11-client-side-shahidulshohid",
        "liveLink": "https://b10-assignment-11.firebaseapp.com/",
        "projectImage": "https://i.ibb.co.com/HhvpkBk/portfolio3.png"
      }
    ]
  }
  